{
  "WWR": {
    "title": "White Water Rafting",
    "description": "I developed a marketing website for a demo company called White Water Rafting that includes a page design, a logo, navigation menu, images, and text. I used semantic elements such as header, nav, main and footer to indicate the different sections of the website, and used CSS classes and ids to style elements. I also used alt tags for images to help users who are visually impaired and improve the SEO of the website. This was one of the first websites that I created.",
    "link": "https://nolanvargas.github.io/WWR/"
  },
  "RNWEATHER": {
    "title": "RN Weather",
    "description": "I developed this weather website as well as the dummy company for a local area in Idaho. I used http requests to https://api.openweathermap.org to get the current weather data for these areas. I also added an algorithm in javascript to calculate wind chill. The page also includes a mobile design that shrinks the nav bar to a toggleable menu. I coded this entirely from scratch with some design requirements. The load times are very slow, because I used full resolution images. If I were to work on this app today then that would be one of the first things on my list to fix.",
    "link": "https://nolanvargas.github.io/rnweather/index.html"
  },
  "SCOOTS": {
    "title": "Scoots",
    "description": "This website was developed for a dummy company that rents scooters in coastal areas. I am most proud of the design on this one because it looks professional and has a responsive design. The footer splits into sections that adjust themselves automatically to the screen width. This site also features integration with a weather api, getting current weather stats using http requests.",
    "link": "https://nolanvargas.github.io/scoots/"
  },
  "SLEEPOUTSIDE": {
    "title": "Sleep Outside",
    "description": "I build the dynamic functionality for this site. The assets like images and site plan were not created by me. Some of the things I worked on were the cart feature, checkout, transactions, and dynamic content for all views. The source for my data comes from the universities servers, which use http, so hosting this site would require a proxy. Almost all my work here was done in javascript, along with the css styling.",
    "content": [
      "./media/sleepOutside/home.jpg",
      "./media/sleepOutside/products.jpg",
      "./media/sleepOutside/item.jpg",
      "./media/sleepOutside/cart.jpg",
      "./media/sleepOutside/checkout.jpg"
    ]
  },
  "R2R": {
    "title": "Rank to Rank",
    "description": "This was originally created to be a site where users could input their rank from a video game and it would be compared with statistics from 8 other games. The input would be converted to a percentile rank using rank population statistics. Acquiring live data from most of these games isn't possible because most companies don't publish this data, but it is collected by 3rd parties at the cost of reliability.",
    "content": ["./media/r2r/demo.gif"]
  }
}
